# This script contains the following points:
#### Exporting PKL DataFrame 'orders_products_combined.pkl'
#### Anwers to Task 4.6, No. 3-9

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
#Creating a path for this project
path = r'C:\Users\mavid\OneDrive - Universidad Nacional de Colombia\Weiterbildung\Exercises\Data_Inmersion\Achivement4\01_23_InstacartBasketAnalysis_CarlosBaena'
print(path)

C:\Users\mavid\OneDrive - Universidad Nacional de Colombia\Weiterbildung\Exercises\Data_Inmersion\Achivement4\01_23_InstacartBasketAnalysis_CarlosBaena

In [5]:
# Importing 'orders_products_combined.pkl' via pandas.pkl and os.path.join
df_ords_prods_comb= pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [6]:
# Checking output
df_ords_prods_comb.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [7]:
# Checking output
df_ords_prods_comb.shape

(32434489, 10)

#### It has the same shape

###  Determine a suitable way to combine the 'orders_products_combined' dataframe with your products data set.

In [10]:
#Importing products_cleaned.csv to df via pandas.read_csv and os.path.join
df_prods_cleaned= pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_cleaned.csv'),index_col = False)

In [11]:
df_prods_cleaned.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [12]:
df_prods_cleaned.shape

(49672, 5)

In [13]:
# Dropping '_merge' column from 'orders_products_combined.pkl'
df_ords_prods_comb = df_ords_prods_comb.drop(columns = ['_merge'])

In [14]:
df_ords_prods_comb.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [15]:
# Merging datasets
df_merged_ords_prods = df_ords_prods_comb.merge(df_prods_cleaned, on = 'product_id', indicator = True)

###  Confirm the results of the merge using the merge flag.

In [16]:
df_merged_ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [17]:
df_merged_ords_prods['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [18]:
df_merged_ords_prods.shape

(32404859, 14)

###  Export the newly created dataframe as orders_products_merged in a suitable format (taking into consideration the size).

In [19]:
# Import to PKL
df_merged_ords_prods.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))